In [ ]:
!pip install auto-sklearn

In [ ]:
!pip install dask distributed --upgrade

In [1]:
import json

import pandas as pd

from autosklearn import classification

/usr/local/lib/python3.7/dist-packages/pyparsing.py:3190: FutureWarning: Possible set intersection at position 3
  self.re = re.compile(self.reString)

In [20]:
sample_data = [{'p_date': '2021-03-28T03:21:35.804Z',
 'p_id': '001',
 'p_loc': 'bangalore',
 'p_name': 'AK',
 'p_w': '2021-03-28T03:21:35.804Z',
 's_date': '2021-03-28T04:34:46.949Z',
 's_loc': 'Bangalore',
 's_name': 'Vision Enterprises',
 's_t': '26',
 's_w': '2021-03-28T04:34:46.949Z',
 'se_date': '2021-03-28T04:40:16.007Z',
 'se_id': '045',
 'se_loc': 'Chennai',
 'se_name': 'Anna Enterprises',
 'se_w': '500',
 'valid': True},
 {'p_date': '2021-02-28T03:21:35.804Z',
 'p_id': '001',
 'p_loc': 'bangalore',
 'p_name': 'AK',
 'p_w': '2021-02-28T03:21:35.804Z',
 's_date': '2021-02-28T04:34:46.949Z',
 's_loc': 'Bangalore',
 's_name': 'Vision Enterprises',
 's_t': '35',
 's_w': '2021-02-28T04:34:46.949Z',
 'se_date': '2021-02-28T04:40:16.007Z',
 'se_id': '045',
 'se_loc': 'Chennai',
 'se_name': 'Anna Enterprises',
 'se_w': '500',
 'valid': False}
 ]

In [21]:
# sample_data = {}
# for k,v in sample_data1.items():
#     sample_data[k] = [v]

In [22]:
sample_data

[{'p_date': '2021-03-28T03:21:35.804Z',
  'p_id': '001',
  'p_loc': 'bangalore',
  'p_name': 'AK',
  'p_w': '2021-03-28T03:21:35.804Z',
  's_date': '2021-03-28T04:34:46.949Z',
  's_loc': 'Bangalore',
  's_name': 'Vision Enterprises',
  's_t': '26',
  's_w': '2021-03-28T04:34:46.949Z',
  'se_date': '2021-03-28T04:40:16.007Z',
  'se_id': '045',
  'se_loc': 'Chennai',
  'se_name': 'Anna Enterprises',
  'se_w': '500',
  'valid': True},
 {'p_date': '2021-02-28T03:21:35.804Z',
  'p_id': '001',
  'p_loc': 'bangalore',
  'p_name': 'AK',
  'p_w': '2021-02-28T03:21:35.804Z',
  's_date': '2021-02-28T04:34:46.949Z',
  's_loc': 'Bangalore',
  's_name': 'Vision Enterprises',
  's_t': '35',
  's_w': '2021-02-28T04:34:46.949Z',
  'se_date': '2021-02-28T04:40:16.007Z',
  'se_id': '045',
  'se_loc': 'Chennai',
  'se_name': 'Anna Enterprises',
  'se_w': '500',
  'valid': False}]

In [59]:
df = pd.DataFrame(sample_data)

In [66]:
df

       p_date p_id      p_loc p_name  ...   se_loc           se_name se_w  valid
0  1616901695  001  bangalore     AK  ...  Chennai  Anna Enterprises  500   True
1  1614482495  001  bangalore     AK  ...  Chennai  Anna Enterprises  500  False

[2 rows x 16 columns]

In [65]:
df["p_date"] = pd.to_datetime(df["p_date"])
df["p_w"] = pd.to_datetime(df["p_w"])
df["s_date"] = pd.to_datetime(df["s_date"])
df["s_w"] = pd.to_datetime(df["s_w"])
df["se_date"] = pd.to_datetime(df["se_date"])
for col in ["p_date", "p_w", "s_date", "s_w", "se_date"]:
    df[col] = (pd.to_datetime(df[col]) - pd.Timestamp("1970-01-01", tz="UTC")) // pd.Timedelta('1s')
    print(df[col])

0    1616901695
1    1614482495
Name: p_date, dtype: int64
0    1616901695
1    1614482495
Name: p_w, dtype: int64
0    1616906086
1    1614486886
Name: s_date, dtype: int64
0    1616906086
1    1614486886
Name: s_w, dtype: int64
0    1616906416
1    1614487216
Name: se_date, dtype: int64

In [86]:
df["s_t"] = pd.to_numeric(df["s_t"])

In [87]:
x_cols = ["p_date", "p_w", "s_date", "s_w", "se_date", "s_t"]

In [88]:
y_cols = {"valid"}

In [89]:
X = df[x_cols]

In [90]:
Y = df[y_cols]

In [91]:
X

       p_date         p_w      s_date         s_w     se_date  s_t
0  1616901695  1616901695  1616906086  1616906086  1616906416   26
1  1614482495  1614482495  1614486886  1614486886  1614487216   35

In [92]:
Y

   valid
0   True
1  False

In [102]:
# automl = classification.AutoSklearnClassifier(ensemble_size=0)

In [101]:
# automl.fit(X, Y)

In [97]:
from sklearn.ensemble import RandomForestClassifier

In [98]:
classifier = RandomForestClassifier()

In [99]:
classifier.fit(X, Y)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestClassifier()

In [100]:
classifier.predict(X)

array([ True, False])